{
    "recipes": [
        {
          "name": "Spicy Arrabiata Penne",
          "category": "Dinner",
          "instructions": "1. Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook according to the package instructions, about 9 minutes. <br><br>2. In a large skillet over medium-high heat, add the olive oil and heat until the oil starts to shimmer. Add the garlic and cook, stirring, until fragrant, 1 to 2 minutes. Add the chopped tomatoes, red chile flakes, Italian seasoning and salt and pepper to taste. Bring to a boil and cook for 5 minutes. <br><br>3. Remove from the heat and add the chopped basil. Drain the pasta and add it to the sauce. Garnish with Parmigiano-Reggiano flakes and more basil and serve warm." ,
          "ingredients": ["1lb penne rigate", "1/4 cup olive oil", "3 garlic cloves", "1 tin chopped tomatoes", "1/2 tsp red chile flakes", "1/2 tsp italian seasoning", "6 basil leaves", "sprinkling of Parmigiano-Reggiano"],
          "time": "30 min",
          "rating": "3",
          "image": "penne.jpg",
          "source": "MealDB"
        }, 

        {
            "name": "Apple Frangipan Tart",
            "category": "Dessert",
            "instructions": "1. Preheat the oven to 200C/180C Fan/Gas 6. Put the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling. <br><br>2. Cream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined. <br><br>3. Peel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds. Bake for 20-25 minutes until golden-brown and set. <br><br>4. Remove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin. Transfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.",
            "ingredients": ["6oz digestive biscuits", " 2oz butter", "7oz Bramley apples", " 3oz butter, softened", "3 oz caster sugar", "2 free-range eggs, beaten", "3oz ground almonds", "1 tsp almond extract", "1 3/4oz flaked almonds"],
            "time": "1 hour",
            "rating": "4",
            "image": "tart.jpg", 
            "source": "MealDB"
        },

        {
            "name": "Strawberry Oatmeal Breakfast",
            "category": "Breakfast",
            "instructions": "1. In a small bowl, toss 1 pint strawberries, rinsed, hulled, and thinly sliced, with 1 to 2 tablespoons firmly packed dark-brown sugar. Let sit at least 5 minutes to bring out the juices. <br><br>2. In a medium saucepan over medium heat, warm 1 3/4 cups water, 1 3/4 cups milk, and 1/4 teaspoon salt. Stir in 2 cups quick-cooking oats; cook, stirring occasionally, until thick and creamy, 5 to 6 minutes. <br><br>3. Ladle oatmeal into bowls. Top each serving with 1 tablespoon sour cream and some of the strawberries; sprinkle with brown sugar.",
            "ingredients": ["1 pint strawberries", "1 Tbs brown sugar", "1 3/4 cups milk", "1/4 tsp salt", "2 cups quick-cooking oats", "1 Tbs sour cream"],
            "time": "15 min",
            "rating": "4",
            "image": "strawberry-oatmeal.jpg",
            "source": "Martha Stewart"
        }, 

        {
            "name": "Avocado Toast",
            "category": "Breakfast",
            "instructions": "1. Mash the avocado with a fork in a shallow bowl until chunky. Season with fine salt and black pepper. <br><br>2. Toast the bread until browned and crisp. Lightly rub 1 side of each slice with the cut side of the garlic until fragrant; discard the garlic. Lightly brush the toasts with oil, and season with fine salt and pepper. Divide the mashed avocado evenly among the toasts, and top with more flaky sea salt, more black pepper and red pepper flakes if using.",
            "ingredients": ["1 8oz ripe avocado", "salt", "pepper", "4 slices bread", "1 garlic clove", "2 Tbs extra-virgin olive oil"],
            "time": "10 min",
            "rating": "5",
            "image": "avocado-toast.jpg",
            "source": "Food Network"
        },

        {
            "name": "Blueberry French Toast",
            "category": "Breakfast",
            "instructions": "1. Cut bread into 1-in. cubes; place half in a greased 13x9-in. baking dish. Cut cream cheese into 1-in. cubes; place over bread. Top with blueberries and remaining bread cubes. <br><br>2. Whisk the eggs, milk and syrup in a large bowl. Pour over bread mixture. Cover and refrigerate for 8 hours or overnight. <br><br>3. Remove from the refrigerator 30 minutes before baking. Cover and bake at 350° for 30 minutes. Uncover; bake 25-30 minutes longer or until a knife inserted in center comes out clean. <br><br>4. Combine the sugar, water and cornstarch until smooth in a small saucepan. Bring to a boil over medium heat; cook and stir until thickened, 3 minutes. Stir in blueberries; bring to a boil. Reduce heat and simmer until berries burst, 8-10 minutes. Remove from heat; stir in butter. Serve with French toast.",
            "ingredients": ["12 slices white bread", "2 pkgs cream cheese", "1 cup blueberries", "12 large eggs", "2 cups milk", "1/3 cup maple syrup or honey"],
            "time": "30 min",
            "rating": "4",
            "image": "french-toast.jpg",
            "source": "Taste of Home"
        }, 

        {
            "name": "Maple-Mustard Pulled Pork",
            "category": "Dinner",
            "instructions": "1. Mix the sea salt and 200g of the sugar in a large food bag, add the pork and coat it well. (If you don’t have a bag, rub over the pork in a dish and cover with cling film.) Leave in the fridge overnight.<br><br>2. The next day, remove the pork and wipe down the meat with kitchen paper. Heat oven to 140C/120C fan/gas Mix the remaining sugar, the maple syrup, mustards and some ground pepper. Rub half the mixture over the pork and sit it on a rack in a roasting tin. Roast for 6 hrs.<br><br> 3. Spoon the remaining maple mixture over the pork and roast for 1 hr more.<br><br>4.  Rest the meat for 30 mins on a plate loosely covered with foil. To serve, tear the pork into big fat chunks and, after skimming the surface, spoon over any juices from the tin.",
            "ingredients": ["200g sea salt", "300g light muscovado sugar", "2kg/4lb 8oz piece pork shoulder", "100ml maple syrup", "100g wholegrain mustard", "2 tbsp English mustard powder"],
            "time": "7 hours",
            "rating": "3",
            "image": "pork.jpg",
            "source": ""
        },

        {
            "name": "Salmon & Spinach with Tartare Cream",
            "category": "Dinner",
            "instructions": "1. Heat the oil in a pan, season the salmon on both sides, then fry for 4 mins each side until golden and the flesh flakes easily. Leave to rest on a plate while you cook the spinach.<br><br>2. Tip the leaves into the hot pan, season well, then cover and leave to wilt for 1 min, stirring once or twice. Spoon the spinach onto plates, then top with the salmon. Gently heat the crème fraîche in the pan with a squeeze of the lemon juice, the capers and parsley, then season to taste. Be careful not to let it boil. Spoon the sauce over the fish, then serve with lemon wedges.",
            "ingredients": ["1 tsp sunflower or vegetable oil", "2 skinless salmon fillet", "250g bag spinach", "2 tbsp reduced-fat crème fraîche", "juice ½ lemon", "1 tsp caper", "2 tbsp flat-leaf parsley, chopped", "lemon wedges, to serve"],
            "time": "30 min",
            "rating": "5",
            "image": "salmon.jpg",
            "source": ""
        },

        {
            "name": "Grilled Cheese",
            "category": "Lunch",
            "instructions": "1. Preheat skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side-down onto skillet bottom and add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side-up on top of sandwich. Grill until lightly browned and flip over; continue grilling until cheese is melted. Repeat with remaining 2 slices of bread, butter and slice of cheese.",
            "ingredients": ["4 slices white bread", "2 slices cheddar cheese", "3 Tbsp butter"],
            "time": "20min",
            "rating": "5",
            "image": "grilledcheese.jpg",
            "source": "All Recipes.com"
        }, 

        {
            "name": "BLT Sandwich",
            "category": "Lunch",
            "instructions": "1. Cook the bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. <br><br>2. Arrange the cooked bacon, lettuce, and tomato slices on one slice of bread. Spread one side of remaining bread slice with the mayonnaise. Bring the two pieces together to make a sandwich.",
            "ingredients": ["4 slices bacon", "2 slices bread, toasted", "2 leaves lettuce", "1 Tbsp mayonnaise", "2 slices tomato"],
            "time": "15min",
            "rating": "4",
            "image": "blt.jpg",
            "source": "All Recipes.com"
        }, 

        {
            "name": "Chocolate Chip Cookies",
            "category": "Dessert",
            "instructions": "1. Preheat oven to 350 degrees F (175 degrees C). <br><br>2. Cream together the butter, white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve baking soda in hot water. Add to batter along with salt. Stir in flour, chocolate chips, and nuts. Drop by large spoonfuls onto ungreased pans. <br><br>3. Bake for about 10 minutes in the preheated oven, or until edges are nicely browned. ",
            "ingredients": ["1 cup butter, softened", "2 tsp hot water", "1/2 tsp salt", "1 cup white sugar", "3 cups flour", "1 cup packed brown sugar", "2 cups semisweet chocolate chips", "2 eggs", "1 cup chopped walnuts"],
            "time": "1hr",
            "rating": "4",
            "image": "cookie.jpg",
            "source": "All Recipes.com"
        }, 

        {
            "name": "Caramel Popcorn",
            "category": "Snack",
            "instructions": "1. Preheat oven to 250 degrees F (95 degrees C). Place popcorn in a very large bowl.<br><br>2. In a medium saucepan over medium heat, melt butter. Stir in brown sugar, corn syrup and salt. Bring to a boil, stirring constantly. Boil without stirring 4 minutes. Remove from heat and stir in soda and vanilla. Pour in a thin stream over popcorn, stirring to coat.<br><br>3. Place in two large shallow baking dishes and bake in preheated oven, stirring every 15 minutes, for 1 hour. Remove from oven and let cool completely before breaking into pieces.",
            "ingredients": ["1 cup butter", "2 cups brown sugar", "1/2 cup corn syrup", "1 tsp salt", "1/2 tsp baking soda", "1 tsp vanilla extract", "5 quarts popped popcorn"],
            "time": "1hr 30min",
            "rating": "5",
            "image": "popcorn.jpg",
            "source": "All Recipes.com"
        }, 

        {
            "name": "Caesar Salad",
            "category": "Lunch",
            "instructions": "1. In a medium bowl, whisk together the egg yolk, lemon juice, garlic, Worcestershire, pepper flakes, mustard, and anchovies. Slowly whisk in the oils to emulsify. Season, to taste, with salt and pepper.<br><br>2. Place the lettuce in a large bowl. Sprinkle with Parmesan and black pepper. Drizzle with desired amount of dressing and toss well. Sprinkle top with croutons.",
            "ingredients": ["1 egg yolk", "3 Tbsp fresh lemon juice", "1 Tbsp minced garlic", "1/2 tsp Worcestershire sauce", "1/4 tsp red pepper flakes", "1 Tbsp Dijon mustard", "2 anchovy fillets, mashed", "Scant 1 cupt vegetable oil", "1/3 cup extra-virgin olive oil", "Salt and freshly ground black pepper", "1 large head romaine lettuce, cut", "freshly grated Parmesan", "2 cups croutons"],
            "time": "20min",
            "rating": "5",
            "image": "salad.jpg",
            "source": "Food Network"
        }, 

        {
            "name": "Granola Bars",
            "category": "Snack",
            "instructions": "1. Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.<br><br>2. In a large bowl, mix together the oats, sweetened condensed milk, butter, coconut, almonds, chocolate chips and cranberries with your hands until well blended. Press flat into the prepared pan.<br><br>3. Bake for 20 to 25 minutes in the preheated oven, depending on how crunchy you want them. Lightly browned just around the edges will give you moist, chewy bars. Let cool for 5 minutes, cut into squares then let cool completely before serving.",
            "ingredients": ["3 cups quick-cooking oats", "1 an sweetened condensed milk", "2 Tbsp butter, melted", "1 cup flaked coconut", "1 cup sliced almonds", "1 cup miniature semisweet chocolate chips", "1/2 cup sweented dried cranberries"],
            "time": "35min",
            "rating": "3",
            "image": "granola.jpg",
            "source": "All Recipes.com"
        }
        
    ]
}